<a href="https://colab.research.google.com/github/hdb4427/python/blob/master/%EA%B3%BC%EC%A0%9C05_01.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
jumsu = [100,75,67,45,80]
for i, val in enumerate(jumsu) :
  if val >= 60 :
    print("%d 번 학생은 합격입니다."%(i+1))
  else : 
    print("%d 번 학생은 불합격입니다."%(i+1))

1 번 학생은 합격입니다.
2 번 학생은 합격입니다.
3 번 학생은 합격입니다.
4 번 학생은 불합격입니다.
5 번 학생은 합격입니다.

In [5]:
import pandas as pd
covid = [['인천','1','2','3'],['부산','1','2','3'],
['대구','1','2','3'],['서울','1','2','3'],['제주','1','2','3']]
df = pd.DataFrame(covid)
df.index = [1,2,3,4,5]
df.columns = ['지역','병상','확진자','사망자']
df

   지역 병상 확진자 사망자
1  인천  1   2   3
2  부산  1   2   3
3  대구  1   2   3
4  서울  1   2   3
5  제주  1   2   3